["Today I learned Several Ted Bundy's victims became deeply depressed and some even had nervous breakdowns when the serial killer died.", "Today I learned the Taj Mahal built in 1653 involved over 20,000 employees, 1000 elephants, & cost the equivalent of $827 million USD", "Today I learned that members of the Church of the Flying Spaghetti Monster (Pastafarians) are allowed to officiate weddings in New Zealand.", "Today I learned that showmen used to get bears drunk, shave them, put dresses and artificial breasts on them, and then exhibit them at fairs as \"Pig-Faced Ladies.\"", "Today I learned visual snow is a rare condition in which you see static, and it is usually more obvious in the dark.", "Today I learned: David Bowie's likeness was stolen for DC comic's version of Lucifer. Quote - \"You must draw David Bowie. Find David Bowie, or I’ll send you David Bowie. Because if it isn’t David Bowie, you’re going to have to redo it until it is David Bowie\"", "Today I learned that the original role of groomsmen was to kidnap the bride and then prevent other suitors or family members from taking her back and at the ceremony preventing her from running away.", "Today I learned That when you are losing weight, the lost mass comes out through breathing and water, and not \"burnt as energy\"", "Today I learned that Napoleon signed the Louisiana Purchase in his bathtub at the Tulleries Palace. An American hotelier in Louisiana bought the tub in 2006 and put it in a hotel in New Orleans for guests to bathe in.", "Today I learned Prince originally signed on for the role of Ruby Rhod in The Fifth Element, but then decided the costume was a little too effeminate for him", "Today I learned a woman married the Berlin Wall in 1979 after being enamored by it since she was seven years old. She was later devastated by its violent deconstruction.", "Today I learned Conan O' Brien wrote the 'Monorail Song' from The Simpsons while he was on their writing staff in the early 90's.", "Today I learned there was actually a priest who turned to wrestling to support an orphanage and it wasn't just made up for the movie Nacho Libre", "Today I learned that during The Great Race of Mercy a sled dog named Togo was the unsung hero but the sled dog Balto received the credit.", "Today I learned that Ted Bundy proposed to his wife, Carole Ann Boone, whilst on trail when she was standing as witness for him. They also had a child called Rose Bundy.", "Today I learned \"No Woman, No Cry\" was written by Jamaican songwriter Vincent Ford who meant the chorus to mean \"No, woman, nuh (=don't) cry\" but used the english creole language Jamaican Patois. He was running a soup kitchen and was a friend of Bob Marley, whose royalties kept his soup kitchen running.", "Today I learned the first black manager in Major League Baseball and first NBA Head Coach were high school teammates", "Today I learned: Donald Ducks nephews Huey, Dewey and Louie are called Knatte, Fnatte och Tjatte in swedish and Kwik, Kwek en Kwak in dutch", "Today I learned the Permian–Triassic extinction event, also known as the Great Dying, wiped out 96% of all marine species and 70% of terrestrial vertebrate species. It is also the only known mass extinction of insects.", "Today I learned In 2009, a British submarine and a French one, both armed with nuclear weapons, collided under the sea!", "Today I learned the original Playstation startup sound is actually just 3 short and simple audio samples contained in the BIOS, played at different speeds and overlapped.", "Today I learned that the myth of Adolf Hitler snubbing Jesse Owens during the 1936 Olympics is partly false. He stopped congratulating any athletes after the opening day to maintain neutrality. However, he did exit the stadium shortly after Cornelius Johnson, another African American, won on opening day.", "Today I learned that in Norse mythology at the end of the world (Ragnarok) the gods--Odin, Thor, Loki and the others--as well as all humans, will die. Evil triumphs over good, and the world will be engulfed in water.", "Today I learned that the latin species name of blue whales, \"musculus\", can be read as either \"muscular\" or \"little mouse\". Blue whales are officially \"little mouse\" whales.", "Today I learned In September 2015, Kevin Strahle (LA Beast) and fellow eaters Takeru Kobayashi, Bob Shoudt, and others, assembled in Chicago, Illinois to consume an entire cooked goat, with the intention of lifting the infamous Chicago Cubs curse. The Cubs would go on to win the World Series the following year.", "Today I learned during WWI the Germans and Russians called a ceasefire to hunt wolves that were killing soldiers on both sides", "Today I learned that in the 1940s President Johnson,at the time a Congressman, used to drive around with a snake in his trunk because he believed black people were scared of snakes. He used to go to fuel stations get served by black guys and make them open the trunk and he was almost beaten with a tire iron", "Today I learned a single Ohio-class submarine can launch 240 nuclear warheads, each equivalent to 30 Hiroshima bombs.", "Today I learned: If the human eye could view all wavelengths of radiation, Betelgeuse would be the brightest star in the night sky", "Today I learned that in the 1900's a high rate of deafness led the indigenous Ka'apor people of Brazil to develop their own sign language.", "Today I learned The two sea lions in Finding Dory were voiced by Idris Elba and Dominic West, two British actors who played Americans—as well as adversaries—on The Wire.", "Today I learned that both the tallest mountain in Europe (Mount Elbrus) and the longest river in Europe (the Volga) are located in Russia.", "Today I learned Brain Electrical Oscillation Signature Profiling is a technique by which a suspect's participation in a crime is detected by eliciting electrophysiological impulses.", "Today I learned J.R.R Tolkien really disliked Celtic Mythology, hated the Irish language, got annoyed if people suggest Celtic more specifically Gaelic influences in his work and believed Ireland to be “naturally evil”", "Today I learned that Ivy League Schools used to take nude photos of all incoming freshmen until the 1960's, claiming it was meant to study posture", "Today I learned that the American English abbreviation commonly used for electrocardiography, EKG, comes from the German word for the procedure, elektrokardiogramm, and it used instead of ECG to avoid confusion with another procedure, an electroencephalogram or EEG.", "Today I learned Transcendentalist scholar and poet Jones Very claimed he was the second coming of Jesus, and that his verse was written under the influence of the holy spirit. When Ralph Waldo Emerson read his work, he noted the poor writing and asked, \"cannot the spirit parse & spell?\"", "Today I learned Kit Kat in Japanese roughly translates to \"Sure Winner.\" As a result, they're considered good luck to Japanese high school students.", "Today I learned That the plasmodium parasite, the thing that causes malaria, first infests your liver. They can stay there for months on end developing without symptoms. Afterwards, they infect red blood cells and cover themselves with the cell membranes to protect themselves from the body's immune system.", "Today I learned the \"Byzantine Empire\" is merely a name used by medieval and modern scholars, first used in 1557 by the German Scholar Hieronymus. The inhabitants of the Eastern Roman Empire actually called themselves \"Romaioi\", meaning Romans. Only after 1204 was Empire mostly seen as hellenic (greek).", "Today I learned the founder of Dolby (Ray Dolby) helped develop the Quadruplex video tape recorder at Ampex, which all modern videotape formats, such as VHS, Betamax, and Video8, are based on.", "Today I learned that a gift given to the president cannot be kept as a personal gift, however, is considered accepted as a property of the United States.", "Today I learned that the 'sexist air-conditioning' story was debunked: the claim the aircon standard is based on a 40 year old 70 kilogram man is false - it was based on criteria from over 1000 subjects with an equal number of women and men. Also the researchers only studied 16 females at a sedentary activity", "Today I learned that there exists a species of sharks that can live up to 500 years. That means that some of them lived through the founding of the US, industrial revolution, and two world wars and are still alive today", "Today I learned the EPA does not recommend the use of indoor air cleaners that emit Ozone as the amount of Ozone required to clean effectively would cause adverse health affects.", "Today I learned after Pauline Picard, 2, disappeared, her family were given another girl who was found 200 miles away. They thought it was Pauline even though she spoke Breton. She lived with them until Pauline’s mutilated body was found near their home with a man’s decapitated head. The case hasnt been solved.", "Today I learned In space someone could hear you scream (provided you had air in your lungs before being hurled into space).", "Today I learned of Steve Hodel, an LA homicide detective who believes his deceased father killed the Black Dahlia, after finding a picture of him with Elizabeth Short. He later discovered his father had been one of the prime suspects at the time of the murder.", "Today I learned about Hazel Scott, a 1940s jazz pianist and singer loved by Hollywood but whose commitment to civil rights ended her US career. She was blacklisted when she refused to allow a costume that stereotyped blacks. She was also the first person of African decent to have their own TV show in America.", "Today I learned The music video for the song \"Star Guitar\" by The Chemical Brothers is a visual representation of the song, with buildings and structures representing drum hits and notes.", "Today I learned WW2 soldiers used to send Japanese body parts including skulls to family members as war trophies.", "Today I learned After the death of the first Chinese emperor, Shi Huangdi, his second oldest son forged a letter in the emperor's name, stating that the eldest son is to commit suicide and the second oldest son would become emperor. That plan worked.", "Today I learned Former Pringle’s manufacturer Procter & Gamble argued in court that Pringle’s crisps are not made from potato to get out of paying VAT, saving the company millions of pounds.", "Today I learned that the inspiration for creating SimCity came when its creator Will Wright was developing a helicopter shoot'em up and found that he enjoyed messing around with the tool that creates the landscape maps more than the game itself!", "Today I learned the will of P.L. Travers (writer of Mary Poppins) specifically forbid all future American adaptions of her work", "Today I learned: In 2007 a thief drove a $280,000 Porsche through the glass window of a Malaysian luxury car showroom. The car was abandoned nearby, its fuel tank empty. The thief kept the keys and returned with a can of gas to the police station where the car was impounded, stealing the vehicle a second time.", "Today I learned in 1976 the first Landsat satellite discovered an island off the western coast of Canada, which was named Landsat Island in honor of its 'discoverer'", "Today I learned that a small group of developers behind Medal of Honor broke away from that series due to the increasing control of EA. They instead created a new game and called it Call of Duty.", "Today I learned of Bálint Syndrome, a neuropsychological disorder that greatly impairs both one’s hand/eye coordination and eye movement capabilities. Making it one of the most debilitating and poorly understood cognitive impairment", "Today I learned about the Gossamer Albatross. The human powered fixed wing aircraft, that crossed the channel in a little under 3 hours, with a top speed of 29km/h. It only needs 300 Watt to fly in still air, about as much power as a blender uses.", "Today I learned of the “Golden Fleece Award” which a senator created for public officials who wasted taxpayer money on unnecessary, silly, or weird projects. He issued the first one to the National Science Foundation for spending $84,000 on a project on love, which he believed was better left a mystery.", "Today I learned that under the Fair Debt Collection Practices Act (FDCPA) there is a federal law prohibiting collection agencies from calling before 8 a.m. or after 9 p.m. without express permission to do so.", "Today I learned that Fangboner Road in Fremont, Ohio is named for Civil War veteran and respected community leader John Fangboner.", "Today I learned the Michelin Guide of Restaurants was created by the Michelin tyre company to make people drive further for great restaurants, wear out their tyres faster and consequently pay more", "Today I learned methamphetamine was widely sold in Nazi Germany in tablet form, and was widely used by soldiers in all three branches of the Wehrmacht forces.", "Today I learned: Many Icelanders believe in the existence of elves (called huldufólk), and building projects are sometimes altered to prevent damaging the rocks where they are believed to live.", "Today I learned that the Homeric Minimum may have been responsible for permanent snow on Mount Olympus, as referred to by Homer and in Greek mythology", "Today I learned that Dan Wilson, lead singer of Semisonic, graduated summa cum laude from Harvard University, co-produced Adele’s album 21 and Taylor Swifts album Red, and wrote hits like “Somebody Like You” and many others.", "Today I learned there's microscopic worms living in millions of people's eyelash follicles and they reproduce while you sleep", "Today I learned Human urine is actually beneficial to plants and can be used as a natural fertilizer because of its composition of nitrogen, potassium and phosphorus.", "Today I learned that Robert Sherman, songwriter of It’s a Small World and many other Disney classics, was one of the first Army liberators of the Dachau concentration camp.", "Today I learned Ricardo Montalban was 47 years old when he played Khan Noonien Singh in the Star Trek episode Space Seed. If his character was the same age, Khan would have had to be born in 1949, 18 years before the episode even aired.", "Today I learned that the same chemical which gives beets their \"earthy\" taste is also partially responsible for the smell the occurs when rain falls after a long dry spell.", "Today I learned Neda Agha Soltan was killed in 2009 by Iranian security forces during an anti-government protest. Her family were barred from holding a memorial service and sent an invoice of $3,000 for the bullet used to kill her, and the cost of recovering her body.", "Today I learned a woman named Glenda Blackwell brought a scratch off lottery ticket to prove to her husband that buying lottery tickets was a waster of money and accidentally ended up winning $1 million.", "Today I learned that Kareem Abdul Jabbar - the NBA player with the most career points ever (38,387), scored only one 3-pointer in his entire 20 season career.", "Today I learned: Mouse plagues are a thing. During a mouse plague, mice come out in the tens of thousands, damaging rural infrastructure and crops. Strangely, Australia and China are the only two countries where mouse plagues happen – and no one really knows why.", "Today I learned Anders Celsius, for whom the Celsius temperature scale is named, actually invented the exact opposite system than today. Celsius' system denoted the boiling point of water at 0° and its freezing at 100°. Someone else reversed the order shortly after he died and it's stuck since.", "Today I learned Some tree species have “crown shyness” when the uppermost branches don’t touch the nearby trees resulting in gaps that resemble channels or zig-zagging.", "Today I learned a 12th Century Abbey in Scotland has a Gargoyle of an Alien from the 1979 Film, after a 1990's restoration project", "Today I learned the longest motorsports event in history was the 169 day long 1908 New York to Paris Race. The American team won the race by 26 days.", "Today I learned about Ice VII, which is different from normal ice in that it is formed from liquid water out of extreme pressure (3 GPa or 30000 atm) and can be found on exoplanets such as GJ1214-b.", "Today I learned Jimi Hendrix (a lefty) played a righty guitar flipped around, because he liked having the whammy bar, volume and tone knobs above the strings.", "Today I learned \"Hit Me Baby One More Time\" was written by a Swede who meant the chorus to mean \"hit me up on the phone one more time\" but mistranslated it", "Today I learned In 1992 while attending a banquet U.S. President George H. W. Bush fainted after vomiting in the lap of then Prime Minister of Japan, Kiichi Miyazawa.", "Today I learned that in 2010 Nicholas Cage purchased a pyramid shaped tomb in New Orlean's oldest cemetery (St. Louis cemetery) as his final resting place, to protect him from vengeful Voodoo spirits, because in 2007 he bought the infamously haunted Madame LaLaurie mansion.", "Today I learned in 2003 the smoke from large bushfires in Canberra, Australia formed a Cumulonimbus Flammagenitus. Essentially the fire created its own supercell storm, complete with lighting and forming an F3-rated fire tornado. The tornado and associated fire killed 4 people and injured 492 others.", "Today I learned in 1992, Guns N’ Roses guitarist Slash overdosed in a hotel hallway and experienced cardiac arrest for 8 minutes before being revived by paramedics and playing a show the next night. He said he \"was pissed off at himself for dying\".", "Today I learned It used to be illegal for men to be topless and show their nipples until a judge overturned New York state's male shirtless bans in 1937 following men protesting for their rights to not sexualize their bare chest", "Today I learned the Chicxulub asteroid responsible for the extinction of non-avian dinosaurs hit the earth coming in at 20 km/s - 20x faster than a rifle bullet", "Today I learned in 663 Japan invaded Korea to restore the conquered Korean kingdom of Baekje. The result was a crushing defeat for Japan. Scholars do not know why Japan expended so much effort for the sake of Baekje and speculate Baekje might have been inhabited by a now-extinct people related to the Japanese.", "Today I learned actor Martin Sheen has been arrested more than any other person in Hollywood (66 times for civil disobedience.)", "Today I learned humans can safely consume about 400mg of caffeine per day without damaging heart health, which is the equivalent of 3.5 cups of coffee", "Today I learned that the longest military conflict in US history were the Indian Wars that lasted intermittently for a staggering 148 years, from the country's founding to 1924.", "Today I learned 20 million people tried to register to get tickets to Led Zeppelin’s reunion show in 2007 at a rate of 80,000 per minute", "Today I learned The Baltic Ace, a Bahamian flagged car carrier, sank in December 2012 carrying over 1400 brand new Mitsubishi's heading for Russia.", "Today I learned that a researcher on Arctic Ice Floe T-3 who killed a co-worker in 1970 was ultimately tried under special maritime law, which \"solved\" the problem of justice for an American victim killed in Canadian waters whose accused killer's first point of landing after leaving T-3 was Greenland.", "Today I learned that Christian Bale flew a 4-year-old cancer patient and his whole family to ''Meet Batman in Disneyland'' for his birthday.", "Today I learned that the Soviet Union accidentally burned down a power plant by generating a 3,400 Amp current in an underground wire by detonating a 300 Kt nuclear missile 290 Km above the ground.", "Today I learned Josh Mancell, the music composer for the Crash Bandicoot and Jak series, also composed the music for Clifford The Big Red Dog."]